src/cf/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ВыплатаЗарплаты</basedOn>
  <basedOn>Document.ПлатёжнаяВедомостьНаАванс</basedOn>
  <basedOn>Document.ВозвратОтПокупателя</basedOn>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Выдать</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДляПечати</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыплатаЗарплаты</types>
      <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ВыплатаЗарплаты</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеРасходы</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/РасходныйКассовыйОрдер/ManagerModule.bsl
#Область Печать

Процедура ПечатьРасходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_РасходныйКассовыйОрдер_РасходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("РасходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=D");
	оШапка.Параметры.ДатаДокументаПрописью = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КредитСубСчет = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ФИОПолучателя = Док.Выдать;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = Док.ПоДокументу;
	оШапка.Параметры.ДолжностьРуководителя = КарточкаОрганизации.Руководитель.Должность;
	оШапка.Параметры.ФИОРуководителя = КарточкаОрганизации.Руководитель.ДляПечати;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	//оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир.ФизическоеЛицо);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

Function PrintLettreDePaiement(Doc, Spreadsheet) Export
	Template = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("LettreDePaiement");
	
	Header = Template.GetArea("Header");
	
	Header.Parameters.Fill(Doc);
	
	FieldPhoto = Doc.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Doc.Контрагент), НСтр("fr = 'Bénéficiaire'; ru = 'Получатель'; en = 'Recipient'; es = 'Destinatario'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Doc.Контрагент), Doc.Контрагент, "");

	Spreadsheet.Put(Header);
	
	If not Doc.ТЧОснования.Count() = 0 then
		Title = Template.GetArea("Title");
		Spreadsheet.Put(Title);
		Num = 0;
		Line = Template.GetArea("Line");
		For Each Str in Doc.ТЧОснования Do
			Num = Num + 1;
			Line.Parameters.Num = Num;
			If ValueIsFilled(Str.Основание) then
				Line.Parameters.Number = Str.Основание.Number;
				If ТипЗнч(Str.Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
					or ТипЗнч(Str.Основание) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда 
					BLNumber = Str.Основание.НомерОтгрузочногоДокумента;
					BLDate = Str.Основание.ДатаОтгрузочногоДокумента;
				Else
					BLNumber = Str.Основание.Номер;
					BLDate = Str.Основание.Дата;
				EndIf;
			Else
				Line.Parameters.Number = "";
				BLNumber = "";
				BLDate = "";
			EndIf;
			Line.Parameters.BLNumber = BLNumber;
			Line.Parameters.BLDate = BLDate;
			Line.Parameters.Somme = Str.Сумма;
			Spreadsheet.Put(Line);
		EndDo;
	EndIf;

	Footer = Template.GetArea("Footer");
	Footer.Parameters.Comment = Doc.Комментарий;
	Spreadsheet.Put(Footer);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти
